;-----------------------------------------------------------
;Created by JY_ZH on 2018_4_7
;-----------------------------------------------------------
		.MODEL	SMalL			; 设定8086汇编程序使用Small model
		.8086				; 设定采用8086汇编指令集
;-----------------------------------------------------------
;	端口常量符号定义，由于I/O端口号不会进行改变，所以用equ而不是db来进行定义
;-----------------------------------------------------------
;
Portin	equ	80h	;定义输入端口号
Portout	equ	88h	;定义输出端口号
;-----------------------------------------------------------
;	定义堆栈段                                             |
;-----------------------------------------------------------
		.stack 100h				; 定义256字节容量的堆栈
;-----------------------------------------------------------
;	Definition of Code Segment                                             |
;-----------------------------------------------------------
		.code						; Code segment definition
		.startup					; 定义汇编程序执行入口点
;--------------------------------------------

Again:

IN  AL,PortIn		;读取开关量状态
NOT AL			;取反
OUT PortOut,AL		;送显示
CALL Delaylong

jmp Again

;--------------------------------------------
;                                           |
; long delay for (red & green) light              |
;                                           |
;--------------------------------------------

Delaylong PROC ; 子程序
    	push cx
    	mov cx, DelayL	;
D0: 	nop
	    nop
	    nop
	    nop
	loop D0
    	pop cx
    	ret
Delaylong ENDP

;--------------------------------------------
;                                           |
; short delay for blingbling of light       |
;                                           |
;--------------------------------------------

Delayshort 	PROC
    	push cx
    	mov cx, DelayS
D1: 	loop D1
    	pop cx
    	ret
Delayshort ENDP


;-----------------------------------------------------------
;	定义数据段                                             |
;-----------------------------------------------------------
		.data					; 定义数据段
DelayS		dw	1FFFH			; 短延时参量	
DelayL		dw	0FFFFH			; 长延时参量


END;指示汇编程序结束编译
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	
